Tekla Open API Reference for Tekla Structures 2025
Operation.MoveAnalysisPartPosition Method
 Moves the analysis part position by translation vector. Only the handle positions can be moved.
 Namespace: Tekla.Structures.Analysis.Operations
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool MoveAnalysisPartPosition(
	AnalysisPart analysisPart,
	AnalysisNode node,
	Vector translation
)
Public Shared Function MoveAnalysisPartPosition (
	analysisPart As AnalysisPart,
	node As AnalysisNode,
	translation As Vector
) As Boolean
Parameters
analysisPart
Type: Tekla.Structures.Analysis.AnalysisPart
The analysis part.
node
Type: Tekla.Structures.Analysis.AnalysisNode
The node.
translation
Type: Tekla.Structures.Geometry3d.Vector
The vector for moving the position.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
Operation Class
Tekla.Structures.Analysis.Operations Namespace